OdDAI.Boolean.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the Boolean data type.
The operator casts specified ANSI string
to the Boolean value and assigns it to the object.
\param val [in] An ANSI string to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Boolean object modified by the assignment operation.
\remarks
The specified ANSI string should be:
* "F" to set the Boolean object to the False value.
* "T" to set the Boolean object to the True value.
In all other cases, the operator makes the Boolean object undefined (its value is unset).

OdDAI.Boolean.#ctor
\details
Creates a new Boolean object with an undefined (unset) value.